app/views/comments/_comment.html.erb

		<small>
			By  at <%= comment.created_at.to_date %>
---
INSERT INTO "comments" ("content", "parent_id", "parent_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "here is another comment for second post!"], ["parent_id", 11], ["parent_type", "Post"], ["created_at", "2018-04-18 19:35:16.472371"], ["updated_at", "2018-04-18 19:35:16.472371"]]