app/controllers/comments_controller.rb

	def create
		if (params[:comment][:parent_type] == 'Post')
			@parent = Post.find(params[:comment][:parent_id])
		else
			@parent = Comment.find(params[:comment][:parent_id])
		end

		@comment = Comment.create(
				content: params[:comment][:content],
				# user_id: current_user.id,
				parent: @parent
				# or you can do
				# user: current_user
			)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "comments" ("content", "parent_id", "parent_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "this comment is for Second Post. "], ["parent_id", 11], ["parent_type", "Post"], ["created_at", "2018-04-18 19:27:57.545146"], ["updated_at", "2018-04-18 19:27:57.545146"]]