app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fourth post !"], ["content", "this is the post created using form ! "], ["created_at", "2018-04-13 15:00:42.989503"], ["updated_at", "2018-04-13 15:00:42.989503"]]
---
	def create
		@post = Post.create(
			title: params[:post][:title],
			content: params[:post][:content]
			# user_id: current_user
			)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Second Post! "], ["content", "Content for second post "], ["updated_at", "2018-04-13 16:23:32.404946"], ["id", 6]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(
			title: params[:post][:title] ,
			content: params[:post][:content]
			# user_id: current_user
			)